# 8) შექმენით რიცხვებით სავსე სია, თქვენი დავალებაა რომ დაპრინტოთ ახალი სია რომელშიც იქნება 
# თქენს პირველ სიაში მყოფი მხოლოდ ლუწი რიცხვები. გამოიყენეთ შესაბამისი სიის ფუნქცია და for ციკლი.ანუ ძველი სიიდან ახალში გადაყარეთ მხოლოდ ლუწი რიცხვები




list=[2,4,-9,33,5788,-5765,43,-675,3]

luwi=[]

for i in range(len(list)):
    if list[i]%2==(0):
        luwi.append(list[i])

print(luwi)

# 9)კომენტარის სახით ჩამოწერეთ სიის ყველა ფუნქცია და მიუწერეთ თ რომელი რას აკეთებს

# append-ამატებს ბოლოში.

# insert- ესეც ამატებს ოღონთ უნდა მიუთითო ინდექსი.

# index-გვეუბნება მერემდენე ინდექსზე რაარის.

# remove-შლის იმ მნიშვნელობას რასაც ფრჩხილებში უწერთ.

# pop-შლის იმ ინდექსზე რომელსაც უთითებ ან თუ არ მიუთითებ ბოლოს.

# clear-ასუფთავებს სიას.

