


/*
4)დააკონსოლლოგე შენი სახელი და გამოიტანე კონსოლში

5)კონსოლში გამოიტანე შენი ასაკი

6)კონსოლში გამოიტანე შენი სიმაღლე

7)ჩამოწერე ყველა მონაცემთა ტიპი(მნიშნველოვანი) და კიუწერე თ რომელი რას ნიშნავს

8)ზემოთ მოცემული დავალებები დააკომენტარე  4 და 5 დავალებები single line ით და 6 და 7 დავალებები multyline კომენტარით */


// console.log('tsotne');

/*
 console.log(14);

 console.log(1.75);
 
*/



// string-ყველაფერი რაც ბრჭყალებშია

// number-რიცხვები

// boolean-true or false

// Bigint- ძალიან დიდი რიცხვები

// null-მნიშვნელობის არმქონე

// undefined- ცარიელი