# 5) შექმენით სტრინგის ცვლადი და ცარიელი სია, 
# თუ სტრინგის ასო არის პატარა, მაშინ ცარიელ სიაში ჩაამატეთ "%" ნიშანი,
#  ხოლო თუ სტრინგის ასო არის დიდი, მაშინ ცარიელ სიაში ჩაამატეთ "@" ნიშანი.
#  თუ მინუსების რაოდენობა სიაში არის ლუწი, მაშინ წაშალე ყველა "%" ნიშანი, ხოლო
#  თუ მინუსების რაოდენობა სიაში არის კენტი, წაშალე ყველა "@" ნიშანი. "%" და "@" -ების
#  თავიდან სიაში ჩასაგდებად გამოიყენეთ for ციკლი, ხოლო "%" ან "@" -ების წასაშლელად გამოიყენეთ while ციკლი.

name="proGRaMireBa"

list1=[]

for i in range(len(name)):
    if name[i]==name[i].lower():
        list1.append("%")
    elif name[i]==name[i].upper():
        list1.append('@')

var1=0

var2=0

n=0

while n<len(list1):
    if list1[n]=="@":
        var1+=1
    elif list1[n]=="%":
        var2+=1
    n+=1
l=0

while l<(len(list1)):
    if var1%2==0 and list1[l]=="%":
        list1.remove('%')
    elif var2%2!=0 and list1[l]=="@":
        list1.remove('@')
    else:
       l+=1

print(list1)