

// 1)შექმენი სია სადაც მოათავსებ ადამიანის სახელებს,შენი დავალებაა
//  რომ ამ სიას გადაუარო ფორ ლუპით და გამოიტანო მხოლოდ ის ელემენტები რომლის სიგრძე მეტია 5 ზე და იწყება ასო "g" ზე

// 2)შექმენი სია სადაცც იქნება მხოლოდ რიცხვები , შენი დავალებაა გამოიტანო მხოლოდ ისეთი რიცხვები რომელიც ლუწია ან 100 ზე მეტია

// 3)შექმენი სია სადაც იქნება სტრინგ ტიპის მოანცემები , შენი დავალებაა გამოიტანო ეს სტრინგები შემდეგნაირად -->
// 1 გოგა
// 2 საბა
// 3 იოანე 
// ...და ა.შ

// let arr = ['tsotne','nika','guranduxti','irakli','akaki','tekla']

// for(let i = 0;i<arr.length;i++){
//     if(arr[i].length>5 && arr[i].startsWith('g')){
//         console.log(arr[i]); 
//     }
// }


// let arr1 = [1,87,105,1111,-6]

// for(let i = 0;i<arr1.length;i++){
//     if(arr1[i]%2==0 || arr1[i]>100){
//         console.log(arr1[i]);
        
//     }
// }
// // let arr = ['tsotne','nika','guranduxti','irakli','akaki','tekla']

// for(let i = 0;i<arr.length;i++){
//     console.log(arr[i]);
    
// }