# 1)კომენტარის სახით ახსენით თუ რა არის ფუნქცია(გადახედეთ რესურსებს)

# ფუნქცია არის ხელსაწყო(ბლოკი) რისი გამოძახებითაც ხდება სხვადასხვა მოქმედებები.

# 2)კომენტარის სახით ახსენით თუ რა არის არგუმენტი

# არგუმენტი არის მნიშვნელობა რომელიც უნდა დაამუშაოს ფუნქციამ

# 3)კომენტარის სახით ახსენით თუ რა არის ჩაშენებული ფუნქცია,მოიყვანეთ სამი მაგალით.

# ჩაშენებული ფუნქცია არის ისეთი ფუნქცია რომელიც უკვე გამზადებულია და მხოლოდ გამოძახებაა საჭირო.როგორიცაა print(), type() და input().

# 4)მოიყვანეთ სამი მაგალითი იმისა რომ --> ფუნქცია არგუმენტად იღებს სხვა ფუნქციას

# მაგალითად:
# variable='vashli'

# for i in range(len(variable)):


# for i in range(5):
#      print('hello')


# print(type(variable))

