
// 1)შექმენი ფუნქცია და დააარქვი რაიმე სახელი 
// , შენი დავალებაა რომ ამ ფუნქციამ კონსოლში გამოიტანოს 
// შენი სახელი და გვარი, გამოიძახე ფუნქცია და ნახე შედეგი კონსოლში



function info(){
    console.log('Tsotne')
    console.log('Photskhveria')
    
    
}


info()


// 2)შენი დავალებაა შექმნა ფუნქცია და გადასცე სამი პარამეტრი(შენი სურვილით)
//  ასევე ამ სამივე პარამეტრს მიანიჭე დეფაულთ მნიშვნელობები , შენი დაალბაა 
// ფუნქციამ დააკონსოლლოგოს რაიმე წინადადება სადაც გამოყენებული იქნება ყველა
//  ეს პარამეტრი , გამოიძახე ფუნქცია ოთხჯერ შემდეგნაირად --> არგუმენტი მიანიჭე
//  მხოლოდ პირველ პარამეტრს და ნახე შედეგი , არგუმენტი მიანშე პირველ და მეორე 
// პარამეტრს და ნახე შედეგი , არგუმენტი მიანიჭე სამივე პარამეტრს და ნახე შედეგი ,
//  არგუმენტი არ მიანიჭო არც ერთ პარამეტრს და ნახე შედეგი

function greet(name='tsotne',surname='photskhveria',city='batumi'){
    console.log('hello , my name is ' +name+' '+surname+'. i live in '+city)
    

}

greet('goga')

greet('goga','chalauri')

greet('goga','chalauri','tbilisi')

greet()