

// 1)შექმენით სია სადაც მოათავსებთ 5 ელემენტს(განსხვავებული ტიპის)
//  თქვენი დავალებაა ინდექსების გამოყენებით გამოიტანოთ სიის თითოეული
//  ელემენტი ცალ ცალკე



// const arr=[10,true,'tsotne',undefined,null]

// console.log(arr[0]);
// console.log(arr[1]);
// console.log(arr[2]);
// console.log(arr[3]);
// console.log(arr[4]);



// 2)მოცემულია მოსწავლეების ქულების სია:

// let scores = [45, 78, 32, 90, 56, 67, 23, 84, 39, 71, 60, 95];

// შენი დავალებაა, ინდექსების გამოყენებით განაახლო ეს სია შემდეგი წესების მიხედვით:

// პირველი ელემენტი გაზარდე 15 ქულით.
// მესამე ელემენტი შეცვალე რიცხვით 50.
// მეხუთე ელემენტს დაუმატე 20.
// მეშვიდე ელემენტი შეცვალე მისი არსებული მნიშვნელობის ორმაგი მნიშვნელობით.
// მეცხრე ელემენტს გამოაკელი 10.
// ბოლო ელემენტი შეცვალე 100-ით.
// მეოთხე ელემენტი გახადე 75.
// მეორე ელემენტი გაზარდე იმდენით, რამდენიც მე-8 ელემენტის მნიშვნელობაა.

// საბოლოოდ console.log()-ში გამოიტანე განახლებული სია.

let scores = [45, 78, 32, 90, 56, 67, 23, 84, 39, 71, 60, 95];


scores[0]+=15
scores[2]=20
scores[4]+=20
scores[6]*=2
scores[8]-=10
scores[11]=100
scores[3]=75
scores[1]+=scores[7]

console.log(scores);
