

# 5) შექმენით ფუნქცია. შექმენი რიცხვებით სავსე სია, სადაც დუბლიკატები 
# - ანუ გამეორებული ელემენტები აღარ იქნება, მაგრამ ელემენტების თანმიმდევრობა შენარჩუნდეს.
#  მაგალითად თუ მოცემული გვქონდა სია: [1, 2, 2, 3, 3, 4, 5, 6, 5], უნდა დავპრინტოთ 
# [1, 2, 3, 4, 5, 6]. გამოიყენე for ციკლი და if. გამოიძახეთ ფუნქცია.

def fun():
    nums=[2,3,56,43223,234,3456,34432,787,9]
    for i in range(len(nums)):
        if nums[i]>nums[i+1]:
            nums.insert(-1,nums[i])
            nums.remove(nums[i])
            i-=1