
// 1) ახსენით რა არის filter და რას შვება იგი?
// 2) გაქვთ მოცემული მასივი let ages = [20,15,40,53,12,32,17,18,19,33,29,85,67]
// თქვენი დავალებაა filter გამოყენებით შექმნათ ორი ახალი მასივი, პირველი ქინება მასივი სადაც მხოლოდ არასრულწლოვნების ასაკი იქნება და მეორე პირიქით სრულწოვანის ასაკი.
// 3) გაქვთ მოცემული მასივი numbers = [25,111,921,321,432,545,133,987,436]
// თქვენი დავალებაა შექმნა newNumber მასივი ჯერ .map გამოყენებით თუ რიცხვი ლუწია გაამრავლო 13
// თუ კენტია გაამრავლო 16, შემდგომ შექმნა ახალი მასივი onlyEven რომელსაც filter გაფილტრავთ newNumber მასივ და მხოლოდ ლუწებს შეინახავთ.

//1) filter არის სიის ფუნქცია რომელიც ახალ ცვლადში ამატებს მხოლოდ იმ მონაცემებს რომლებიც აკმაყოფილებენ პირობას


// 2)
let ages = [20,15,40,53,12,32,17,18,19,33,29,85,67]

let minor = ages.filter(x=>x<18)
let adult = ages.filter(x=>x>=18)

console.log(minor)
console.log(adult)

// 3)

let numbers = [25,111,921,321,432,545,133,987,436]

let newNumber = numbers.map(x=>x%2==0?x*13:x*16)

let onlyEven = newNumber.filter(x=>x%2==0)

console.log(onlyEven);
