// 1) დაწერე კოდი სადაც გექნება მასივი Prices = [,20,100,2,500,132,315,15] და ასევე მასივი Items = ["phone","book","mask","glasses","sticker","bottle","coke"]
// შენი დავალებაა: 
// 1.1 დააწყვილო ეს ელემენტები ან მაგალითად ---> ნივთი: phone 
//                                              ფასი:  20


// let Prices = [,20,100,2,500,132,315,15]

// let Items = ["phone","book","mask","glasses","sticker","bottle","coke"]

// Items.forEach((x,ind)=>console.log(`${x}:${Prices[ind]}`))


// 2) თქვენი დავალებაა:
// 2.1 სერვერმა გამოგზავნა ქსელური პაკეტების კოდების მასივი (რიცხვები). კრიტიკული უსაფრთხოების ასამუშავებლად, 
// ჯერ უნდა შეამოწმო, არის თუ არა სისტემაში თუნდაც ერთი უკიდურესად საშიში ვირუსული პაკეტი
// (რიცხვი, რომელიც იყოფა 7-ზე და მეტია 500-ზე). თუ ეს დადასტურდა, უნდა ამოიღო მხოლოდ ის პაკეტები,
// რომლებიც ლეგიტიმურია (ლეგიტიმურია პაკეტი, თუ ის დადებითია, არ იყოფა 3-ზე და ნაკლებია 1000-ზე).
// მასივი: const packets = [120, 505, -45, 999, 14, 700, 33, 842];

const packets = [120, 505, -45, 999, 14, 700, 33, 842];
let ind = 

// 3) თქვენი დავალებაა:
// 3.1 საწყისი ენერგიის დონეების მასივიდან უნდა გაფილტრო მხოლოდ ის ენერგიები, რომლებიც მეტია 10-ზე და ნაკლებია 150-ზე. ამის შემდეგ, მიღებული შედეგი უნდა გარდაქმნა „კვანტურ კოეფიციენტად“: თითოეული ელემენტი გაამრავლო 3-ზე, გამოაკლო 5 და საბოლოოდ შედეგი გადაიყვანო სტრიქონშიპრეფიქსით "Q-" (მაგ: "Q-45").
// მასივი: const rawEnergies = [5, 45, 120, 200, 12, 88, -10, 150];

// 4) თქვენი დავალებაა:
// 4.1 სერვერთან დასაკავშირებლად მომხმარებლის უსაფრთხოების ტოკენების სია (tokens) მკაცრ სტანდარტს უნდა აკმაყოფილებდეს. გამოიყენე every იმის შესამოწმებლად, არის თუ არა ყველა ტოკენი ისეთი, რომ:
//     1.იწყება პრეფიქსით "SEC-"
//     2.მისი სიგრძე მეტია ან ტოლია 8 სიმბოლოზე.
// ოღონდ გაქვს 3 სერვერი და სამივე token შეამოწმე:
// მასივები: const tokens_serv1 = ["SEC-0091", "SEC-7821", "SEC-1111", "SEC-999"];
//          const tokens_serv2 = ["SEC-0091", "SEc-1111", "SEC-1111", "SEC-9999"];
//          const tokens_serv3 = ["SEC-0000091", "SEC-7821", "SEC-1111"];