# 11)კომენტარის სახით ჩამოწერეთ ის სამი ტექნიკა რასაც კომპიუტერი
#  იყენებს პრობლემების გადასაჭრელად კოდში,თითეულს მიუწერე თავიანთ ახსნა
#  განმარტება გვერდით


#  =============================================================
#  1)sequence-მიმდინარეობა; კითხულობს ზემოდან ქვემოთ მაგ:
# name=("cotne")
# name=("giorgi")
# print(name)
#  =============================================================
#  2)interation-გამეორება, როდესაც იმეორებს კოდს გარკვეული სიმრავლით მაგ:
# for i in range(10):
#     print(i)
#  =============================================================
#  3)selection-არჩევა, როდესაც ორი შესაძლო კოდიდან ერთს ირჩევს მაგ:
# name=input("enter your name")
# if name==("cotne"):
#     print("your name is cotne")
# else:
#     print("your name isn't cotne")
#  =============================================================