#2) მომხმარებელს შემოატანინე ორი რიცხვი:
#--> ქულა (score)
#--> დასწრება (attendance პროცენტებში)
#შემდეგ შეამოწმე:
#თუ ქულა მეტია 80-ზე და დასწრება მეტია 90-ზე -> "შენ შესანიშნავად დაწერე გამოცდა"
#თუ ქულა მეტია 50-ზე და დასწრება მეტია 70-ზე -> "საშუალოდ დაწერე გამოცდა"
#თუ ქულა მეტია 30-ზე ან დასწრება მეტია 50-ზე -> "გაჭირვებით, მაგრამ ჩააბარე გამოცდა"
#ყველა სხვა შემთხვევაში → "ჩაიჭერი!"

ქულა=int(input("შეიყვანე მიღებული რიცხვი"))
დასწრება=int(input("შეიყვანეთ დასწრება"))

if ქულა>80 and დასწრება>90:
    print("შენ შესანიშნავად დაწერე გამოცდა")
elif ქულა>50 and დასწრება>70:
    print("საშუალოდ დაწერე გამოცდა")
elif ქულა>30 or დასწრება>50:
    print("გაჭირვებით, მაგრამ ჩააბარე გამოცდა")
else:
    print("ჩაიჭერი")