



console.log('tsotne'.length)

console.log('tsotne'.toUpperCase())


console.log('TSOTNE'.toLowerCase())

console.log('tsotne'.startsWith('g'))


console.log('              tsotne                        '.trim())



console.log('ჰიდროელექტროსადგური'.slice(5,12))



/*4)იპოვე შნეი სახელის სიგრძე

5)გადაიყვანე შენი სახელი დიდიდნ პატარა ასოებში და პირიქით პატარიდან დიდში

6)შეამოწმე იწყება თუ არა შენი სახელი ასო "g" ზე

7)შექმენი სტრინგი რომელსაც ექნება white spaces ,შენი დავალებაა დაბეჭდო ის სფეისების გარეშე

8)გვაქვს სტრინგი --> "ჰიდროელექტროსადგური" შენი დავალებაა კონსოლში გამოიტანო -->"ელექტრო" გამოიყენე შესაბამისი მეთოდი*/