// 1)შექმენი ორი კამათელი:
// let dice1 = ...
// let dice2 = ...
// ორივე კამათლის მნიშვნელობა შემთხვევით უნდა შეიქმნას 1-დან 6-მდე.
// პროგრამამ უნდა:
// დაბეჭდოს ორივე კამათლის შედეგი.
// გამოთვალოს მათი ჯამი.
// თუ ჯამი არის 10 ან მეტი → დაბეჭდოს "ძალიან კარგი შედეგია!"
// თუ ჯამი არის 7-დან 9-მდე → "კარგი შედეგია!"
// თუ ჯამი 7-ზე ნაკლებია → "ცუდი შედეგია!"
// დამატებითი წესი:
// თუ ორივე კამათზე ერთი და იგივე რიცხვი ამოვიდა, დაბეჭდე:
// "დუბლი!"

// let dice1 = Math.ceil(Math.random()*6)
// let dice2 = Math.ceil(Math.random()*6)

// console.log(dice1);
// console.log(dice2);


// dice1 === dice2 ? console.log("დუბლი!") : 
// dice1+dice2>=10 ? console.log("ძალიან კარგი შედეგია!") :
// dice1+dice2>=7 ? console.log("კარგი შედეგია!") : console.log("ცუდი შედეგია!")


 



// 2)შექმენი ორი შემთხვევითი ძალა:
// let hero = ...
// let monster = ...
// გმირის ძალა უნდა იყოს 20-დან 40-მდე
// მონსტრის ძალა უნდა იყოს 15-დან 35-მდე
// შემდეგ:
// დაბეჭდე ორივეს ძალა.
// თუ გმირის ძალა მეტია → "გმირმა მოიგო!"
// თუ მონსტრის ძალა მეტია → "მონსტრმა მოიგო!"
// თუ ძალები ტოლია → "ბრძოლა ფრედ დასრულდა!"
// დამატებითი წესი:
// თუ გმირის ძალა ზუსტად 30 აღმოჩნდა, მას დაემატოს 10 ძალა.
// ამის შემდეგ თავიდან უნდა შეადარო საბოლოო ძალები.

// let hero = Math.floor(Math.random()*20)+20
// let monster = Math.floor(Math.random()*20)+15

// console.log(hero)
// console.log(monster);


// hero>monster ? console.log("გმირმა მოიგო!") :
// monster>hero ? console.log("მონსტრმა მოიგო!") : console.log("ბრძოლა ფრედ დასრულდა!");


// hero===30 ? hero+=10 :


// hero>monster ? console.log("გმირმა მოიგო!") :
// monster>hero ? console.log("მონსტრმა მოიგო!") : console.log("ბრძოლა ფრედ დასრულდა!");




// 3)შექმენი მანქანის შემთხვევითი სიჩქარე 40-დან 120-მდე.
// პროგრამამ უნდა განსაზღვროს:
// 40-დან 60-მდე → "ნელა მიდის"
// 61-დან 90-მდე → "ნორმალური სიჩქარე"
// 91-დან 110-მდე → "სწრაფად მიდის"
// 111-დან 120-მდე → "ძალიან სწრაფად მიდის"
// დამატებითი წესი:
// თუ სიჩქარე ზუსტად 100 აღმოჩნდა, დაბეჭდე:
// "ზუსტად 100 კმ/სთ!"
// ეს შეტყობინება ჩვეულებრივ კატეგორიასთან ერთად უნდა გამოვიდეს.

// let V = Math.floor(Math.random()*80)+40

// switch(true){
//     case V>110:
//         console.log("ძალიან სწრაფად მიდის");
//         break
//     case V>90:
//         console.log("სწრაფად მიდის");
//         break  
//     case V>60:
//         console.log("ნორმალური სიჩქარე");
//         break   
//     case V>39:
//         console.log("ნელა მიდის");
//         break  
// }


// 4)შექმენი შემთხვევითი რიცხვი 1-დან 10-მდე, რომელიც წარმოადგენს მოთამაშის მიერ არჩეულ ყუთს.
// შემდეგ თითოეული რიცხვისთვის განსაზღვრე რა შეხვდა მოთამაშეს:
// 1-3 → "ცარიელი ყუთი"
// 4-6 → "10 მონეტა"
// 7-8 → "30 მონეტა"
// 9 → "50 მონეტა"
// 10 → "100 მონეტა და ბონუსი!"
// მაგრამ აქ დამატებითი პირობაა:
// თუ მოთამაშემ მიიღო 10, შექმენი კიდევ ერთი შემთხვევითი რიცხვი 1-დან 5-მდე.
// თუ მეორე რიცხვი 5 გამოვიდა → "სუპერ ბონუსი!"
// სხვა შემთხვევაში → "ჩვეულებრივი ბონუსი!"


// let num = Math.ceil(Math.random()*10)



// switch(true){
//     case num===10:
//         console.log("100 მონეტა და ბონუსი!");
//         let bonus = Math.ceil(Math.random()*5)
//         if(bonus === 5){
//             console.log("სუპერ ბონუსი!");
//         }else{
//             console.log("ჩვეულებრივი ბონუსი!")
//         }
//         break
//     case num===9:
//         console.log("50 მონეტა");
//         break
//     case num>=7:
//         console.log("30 მონეტა");
//         break   
//     case num>=4:
//         console.log("10 მონეტა");
//         break 
//     default:
//         console.log("ცარიელი ყუთი");
        
// }

// 5)let player1 = ...
// let player2 = ...
// თითოეულ მოთამაშეს უნდა ჰქონდეს შემთხვევითი ძალა 10-დან 30-მდე.
// შემდეგ თითოეულ მოთამაშეს შეუქმენი შემთხვევითი დაცვის ქულა 1-დან 10-მდე:
// Player 1 → ძალა + დაცვა
// Player 2 → ძალა + დაცვა
// მოთამაშის საბოლოო საბრძოლო ქულა უნდა გამოითვალოს ასე:
// ძალა + დაცვა
// მაგრამ არის სპეციალური წესები:
// თუ მოთამაშის ძალა ზუსტად 20 აღმოჩნდა → დაემატოს 5 ქულა.
// თუ დაცვის ქულა 10 აღმოჩნდა → დაემატოს კიდევ 3 ქულა.
// ამის შემდეგ შეადარე ორივე მოთამაშის საბოლოო საბრძოლო ქულა და გამოავლინე გამარჯვებული.
// თუ საბოლოო ქულები თანაბარია → "ფრეა!"


// let player1 = Math.floor(Math.random()*20)+10
// let player2 = Math.floor(Math.random()*20)+10


// let defence1 = Math.ceil(Math.random()*10)
// let defence2 = Math.ceil(Math.random()*10)


// if(player1===20){
//     player1+=5
// }else if(defence1===10){
//     defence1+=3
// }

// if(player2===20){
//     player2+=5
// }else if(defence2===10){
//     defence2+=3
// }

// player1+=defence1
// player2+=defence2

// if(player1>player2){
//     console.log('მოიგო პირველმა');
// }else if(player1<player2){
//     console.log('მოიგო მეორემ');
// }else{
//     console.log('ფრეა');
    
// }



// 6)შექმენი სამი შემთხვევითი რიცხვი:
// პირველი → 1-დან 20-მდე
// მეორე → 1-დან 20-მდე
// მესამე → 1-დან 20-მდე
// შემდეგ პროგრამამ უნდა შეამოწმოს:
// თუ სამივე რიცხვი ერთმანეთის ტოლია → "ჯეკპოტი!"
// თუ მხოლოდ ორი რიცხვია ტოლი → "ორი ერთნაირი რიცხვი!"
// თუ სამივე განსხვავებულია → "სამივე განსხვავებულია"
// მაგრამ შემდეგ კიდევ ერთი შემოწმება გააკეთე:
// სამივე რიცხვის ჯამი:
// თუ 40-ზე მეტია → "დიდი ჯამი"
// თუ 40 ან ნაკლებია → "პატარა ჯამი"
// ანუ პროგრამამ უნდა გამოიტანოს ორივე შედეგი.


// let fir = Math.ceil(Math.random()*19)
// let sec = Math.ceil(Math.random()*19)
// let thi = Math.ceil(Math.random()*19)


// if(fir===sec && sec===thi){
//     console.log("ჯეკპოტი!");  
// }else if(fir===sec || sec===thi || thi===fir){
//     console.log("ორი ერთნაირი რიცხვი!");
// }else{
//     console.log("სამივე განსხვავებულია");
// }

// if(fir+sec+thi>40){
//     console.log( "დიდი ჯამი");
// }else{
//     console.log( "პატარა ჯამი");
// }


// 7)შექმენი ორი მოთამაშე:
// let player1 = 0;
// let player2 = 0;
// თითოეული მოთამაშისთვის შექმენი 3 შემთხვევითი რაუნდის ქულა, სადაც თითოეული ქულა არის 1-დან 10-მდე.
// მაგალითად:
// Player 1:
// რაუნდი 1 → 7
// რაუნდი 2 → 4
// რაუნდი 3 → 9
// Player 2:
// რაუნდი 1 → 6
// რაუნდი 2 → 8
// რაუნდი 3 → 5
// შემდეგ:
// დაითვალე თითოეული მოთამაშის სამი რაუნდის ჯამი.
// თუ რომელიმე რაუნდში მოთამაშემ ზუსტად 10 ქულა მიიღო, მას დამატებით 5 ბონუსი დაემატოს.
// თუ მოთამაშემ სამივე რაუნდში 5-ზე მეტი ქულა მიიღო, მას დამატებით 3 ბონუსი დაემატოს.
// საბოლოოდ შეადარე მოთამაშეების ქულები.
// გამოიტანე გამარჯვებული ან "ფრეა!"


// let player1 = 0;
// let player2 = 0;
// let sum1=0
// let sum2=0
// for(let i = 0;i<3;i++){
//     let num = Math.ceil(Math.random()*9)
//     if(num===10){
//         player1+=5
//     }
//     sum1+=1
//     player1+=num
//     let num2 = Math.ceil(Math.random()*9)
//     if(num2===10){
//         player2+=5
//     }
//     sum2+=1
//     player2+=num2
// }
// if(sum1===3){
//     player1+=3
// }
// if(sum2===3){
//     player2+=3
// }
// if(player1>player2){
//     console.log('მოიგო პირველმა');
// }else if(player1<player2){
//     console.log('მოიგო მეორემ');
// }else{
//     console.log('ფრე');
    
// }