

// 1)შექმენით სია სადაც იქნება სახელები , გამოიტანეთ მხოლოდ ის სახელები რომლის სიგრძე მეტია 4 ზე

// let names = ['tekla','akaki','lizi','ana','irakli']

// names.forEach(name=>{
//     if(name.length>4){
//         console.log(name);
//     }
// })



// 2)შექმენით სია სადაც მოცემული იქნება რიცხვები , თქვენი დავალებაა გამოიტანოთ მხოლოდ ისეთი რიცხვები რომელიც არის კენტი და დგას კენტ ინდექსზე


// let nums = [12,-91,0,12331,98]

// nums.forEach((num,index)=>{
//     if(index%2!=0 && num%2!=0){
//         console.log(num);
//     }
// })



// 3)მოცემულია:
// let scores = [45, 78, 32, 90, 56, 84, 67];
// გამოიყენე .map() და შექმენი ახალი სია newScores.
// წესები:
// თუ ქულა 60-ზე ნაკლებია, მას დაემატოს 10.
// თუ ქულა 60 ან მეტია, მას დაემატოს 5.
// ძველი scores სია არ უნდა შეიცვალოს.
// გამოიყენე ერთი .map().

// let scores = [45, 78, 32, 90, 56, 84, 67];

// let newScores = scores.map((score)=>{
//     if(score<60){
//         return score+10
//     }else{
//         return score+5
//     }
// })

// console.log(newScores);
