# 0)კომენტარის სახით ახსენით თუ რა არის muttable და რა არის immutable

# ახსენით რატომ არის სია mutable

# ახსენით რატომ არის სტრინგი იმმუტაბლე


# mutable ნიშნავს შეცვლადს ანუ მონაცემთა ისეთი ტიპს რომელსაც რამოდენიმე მონ.ტიპის შენახვა შეუძლია, ასეთებს შეუძლიათ შეცვალონ რომელიმე მონაცემი.
#  imutable კი ნიშნავს შეუცვლელს.

# სია იმიტომაა ცვლადი რომ სხვადასხვა მონაცემთა სახეებს შეიცავს, ხოლო სტრინგი ერთი მონაცემთა სახეა


# 1)დაპრინტე სიის პირველი და ბოლო ელემენტი ინდექსების გამოყენებით.

# fruits = ["apple", "banana", "mango", "kiwi"]

fruits = ["apple", "banana", "mango", "kiwi"]

print(fruits[0])
print(fruits[3])



