# 1)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებთ რაიმე რიცხვს

# შექმენი მეორე ცვლადი სადაც მომხმარებელს შემოატანინებთ რაიმე სახელს

# შეამოწმე-->

# თუ შემოყვანილი ასაკი მეტოა 60 ზე მაშინ შეამოწმე შიგნით -->
#     თუ შემოყვანილი სახელი არის --> "kote"  მაშინ დაუპრინტე --> შენი სახელია კოტე და ხარ მოხუცი
#     სხვა შემთხვევაში დაუპრინტე --> შენი სახელი არ არის კოტე მაგრამ ხარ მოხუცი

# თუ ასაკი ნაკლებია 60 ზე მაშინ შეამოწმე შიგნით -->
#     თუ შემოყვანილი სახელი --> "kote" მაშინ დაუპრინტე --> შენი სახელი არის კოტე მაგრამ შენ ხარ ახალგაზრდა:
#     სხვა შემთხვევაში დაუპრინტე --> შენი სახელი არ არის კოტე მაგრამ ხალ ახალგაზრდა






 

name=input('enter your name')

age=int(input('enter your age'))

if age>60:
    if name=='kote':
        print('you are kote and old')
    else:
        print('you are not kote and old')
elif age<60:
    if name=='kote':
        print('you are kote and young')
    else:
        print('you are not kote and young')
    
