
# 5)
# მომხმარებელმა შეიყვანოს ქულა (0–100).
# თუ ქულა მეტია 50-ზე, შიგნით შეამოწმე:

#   თუ მეტია 90-ზე, დაბეჭდე "შესანიშნავი"

#   თუ არა — "გასული ხარ"

# სხვა შემთხვევაში დაბეჭდე - "დაბალი ქულა"


mark=int(input('enter your score from 0/100:'))

if mark>50:
    if mark>90:
        print('sesanishnavia')
    else:
        print('gacxvedi')
else:
    print('dabali qula')




# 6)კომენტარის სახით ახსენით თუ რა არის სია და რაშივიყენებთ მას,ასევე ახსენი თუ რით განსხვავდება იგი ცვლადისგან

# სია--list  იგი არის მონაცემთა ერთერთი ტიპი რომელსაც ვიყენებთ იმისათვის რომ მონაცემთა ტიპები შევინახოთ ერთად ერთ ცვლადში,
#  იგი ცვლადისგან განსხვავდება იმით რომ აქ შეგიძლია ჩაამატო ბევრი მონაცემები


# 7)შექმენი სია სადაც შეინახავ მხოლოდ სტრინგ ტიპის მონაცემებს


string=['cotne','giorgi', 'badri','joni']

# 8)შექმენი სია სადაც შეინახავ მხოლოდ ინტეჯერ ტიპის მონაცემებს

intejer=[10,5,34,12]

# 9)შექმენი სია სადაც შეინახავ მხოლოდ ბულეან ტიპის მონაცემებს

boolean=['true','false', 'true and false', 'true or false']
# 10)შექმენი სია სადაც შეინახავ მხოლოდ ფლოუტ ტიპის მონაცემებს

float1=[4.5,6.7,8,1]

# 11)შექმენი სია სადაც შეინახავ ყველა მონაცემთა ტიპის ელემენტს 

var=['cotne','true',15,3.4]
