// 1)შექმენით სახედლების სია , შენი დავალებაა რომ სიის ბოლოდან ამოშალო ერთ ელემენტი ,
// და ამის შემდეგ სიის ბოლოში ჩაამატო ორი ელემენტი --> true და "gigi"

// შემდეგ შენი დავალებააა სიის დასაწყისიდან ამოშალოთ ელემენტი და დაამატო სიის თავში სიტყვა
//  "avtomobili" ბოლოს დაბეჭდე საბოლოო სია

// let arr = ['tsotne','irakli','barbare','nia','akaki']

// arr.pop()

// arr.push(true,'gigi')

// arr.shift()

// arr.unshift('avtomobili')

// console.log(arr)



// 2)შექმენით ორი სია,ერთში იყოს სტრინგები მეორეში რიცხვები,ორივე სიაში იყოს ხუთ ხუთი ელემენტი ,
//  შენი დავალებაა ეს ორი სია ერთმანეთში გაააერთიანო,
//  ამის შემდეგ ამ გაერთიანებულ სიის ბოლოში დაამატე true და ამოშალე პირველი ელემენტი

// ამის შემდეგ შენი დავალებაა რომ შექმნა ახალი სია სადაც იქნება მესამე ინდექსიდან მეექვსე ინდექსამდე
//  ელემენტები .slice() გამოყენებით და დაბეჭდო ეს ახალი სია,შემდეგ Array.isArray() ის დახმარებით
//   დაბეჭდე არის თუ არა ეს ახალი მიღებული მნშვნელობა მანდვილად სია

let arr1 = ['Python','Javascript','HTML','CSS','Java']

let arr2 = [13,21,81,10,35]

let newArr = arr1.concat(arr2)

newArr.push(true)
newArr.shift()


let sliced = newArr.slice(3,6)


console.log(sliced);


console.log(Array.isArray(sliced));
